
def area(a):
    '''
    Возвращает площадь квадрата со стороной a
    Параметры:
        a (int): длина стороны квадрата
    Возвращаемое значение:
        area(int): площадь квадрата
    Пример вызова:
        area(50) -> 2500
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a
    Параметры:
        a (int): длина стороны квадрата
    Возвращаемое значение:
        perimeter(int): периметр квадрата
    Пример вызова:
        perimeter(50) -> 200
    '''
    return 4 * a
